posts/python-cookbook-readnote-1/index.org
#+BEGIN_COMMENT
.. title: Python Cookbook 读书笔记（一）
.. slug: python-cookbook-readnote-1
.. date: 2017-07-10
.. tags: python
.. category: 
.. link: 
.. description: 
.. type: text
#+END_COMMENT


#+TITLE:       Python Cookbook 读书笔记
#+AUTHOR:      Astropeak
#+EMAIL:       astropeak@gmail.com
#+DATE:        2017-07-10
#+URI:         /blog/%y/%m/%d/python-cookbook-readnote
#+KEYWORDS:    python, cookbook, reading notes
#+TAGS:        python, reading notes
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: Python coookbook reading notes

《[[http://shop.oreilly.com/product/0636920027072.do][Python Cookbook]]》读书笔记.
* chapter 1: Data Structures and Algorithms
** 1.6 Mapping Keys to Multiple Values in a Dictionary, by list value and defaultdict
   example: create a dictionary with default value, by defaultdict
   
   dictionary's property:
   1. you can add new key to a dictionary
   2. but when you access a key that not exists, there will be error
   3. defaultdict is used to fix such problem.
      
   #+BEGIN_SRC python
   from collections import defaultdict
   `dict` = defaultdict(`func list`)
   # `dict`['aaa'].append(2)
   $0
   #+END_SRC
   
** 1.6 example
   #+BEGIN_SRC python
   from collections import defaultdict
   frequency = defaultdict(int)
   frequency['colorless'] = 4
   frequency['ideas'] # will be 0
    
   frequency = defaultdict(list)
   # first, frequency['colorless'] will return a empty list, then append one element to this list.
   frequency['colorless'].append(4)
   frequency['ideas'] # will be []
    
   # Or you can pass a function take no arguments 
    
   # the idiom:
   my_dictionary = defaultdict(function to create default value)
   for item in sequence:
   my_dictionary[item_key] is updated with information about item
   #+END_SRC
** 1.7 Keeping Dictionaries in Order, OrderedDict
   #+begin_src python
   form collections import OrderedDict
   d = OrderedDict()
   # the insertion order will be reserved.
   #+end_src
   
   An typical application is when for serilization.
   
** 1.8. Calculating with Dictionaries
*** get max key/value in a dictionary, based on the value, by inverting the dict
    #+begin_src python
    max(zip(`dict`.values(), `dict`.keys()))
    # another solution
    # max(`dict`, key=lambda k:`dict`[k])
    #+end_src
    first convert the dict to list of (value, key) pairs, then max function will first compare value, then compare key.
*** result of the max value for many  things
    for tuple and list, it just the element.
    but for a dict, it returns only the key. Why? Because it accept a iterable as first parameter, and for a dictionary, the iterable value is the key.
*** understanding of multi value bind
    --->  (b11, b12) = 1
    TypeError: 'int' object is not iterable
    
    The right hand side should be an iterable, every element in the iterable will be asigned to the left hand side variable, with each variable comsume one element exzactly. If the number of elements and variables not match, then there will be an error.
    
    To consume more than one values, use the '*varname' expresstion, then the variable 'varname' will be a list of many elements.
    
    Back to the error prints in the example, the 'int' object refers to the right side '1'.
    
    PS:
    I find python much simpler and funny than java.
** 1.9. Finding Commonalities in Two Dictionaries
   a dictionary's d.keys() and d.items() support set operations
   So to find the common part keys/items in two dictionaries, just use the set operation '|' or 'union' function.
*** get all keys as a iterable in a dictionary, by keys()
    #+begin_src python
`dict`.keys()
    #+end_src
    
*** get all values as a iterable in a dictionary, by values()
    #+begin_src python
`dict`.values()
    #+end_src
    
*** get all key, value pairs as a iterable in a dictionary, by items()
    #+begin_src python
`dict`.items()
    #+end_src
    
*** set operations
    '|': union
    '&': intersection
    '-': difference
    's1 < s2': check if s1 is a subset of s2
    
    Example:
    In [101]: e.keys(), d.keys()
    Out[101]: (dict_keys([1, 4, 'a', 9]), dict_keys([1, 3, 5]))
    
    In [102]: e.keys() & d.keys()
    Out[102]: {1}
    
    In [103]: e.keys() | d.keys()
    Out[103]: {1, 3, 4, 5, 'a', 9}
    
    In [104]: e.keys() - d.keys()
    Out[104]: {9, 4, 'a'}
    
** 1.10. Removing Duplicates from a Sequence while Maintaining Order
