posts/python-cookbook-readnote-1/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Python Cookbook 读书笔记（一） | Astropeak</title>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display">
<link rel="stylesheet" href="../../assets/css/libretto_styles.css">
<link href="../../assets/css/custom.css" rel="stylesheet" type="text/css">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
            <h1 class="site-title">
                <a href="https://astropeak.github.io/" title="Astropeak" rel="home">Astropeak</a>
            </h1>
        </div>
        <nav class="site-navigation" role="navigation"><div class="menu-toggle">
                <span class="mobile-site-title">Astropeak</span>
            </div>
            <ul class="menu">
<li><a href="../../archive.html">Archive</a></li>
                    <li><a href="../../categories/">Tags</a></li>
                    <li><a href="../../rss.xml">RSS feed</a></li>
                    <li><a href="http://github.com/astropeak">Github</a></li>
            </ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
        <div class="entry-meta">
            <span class="posted-on">
                Posted on <a href="." rel="bookmark">July 10, 2017</a>
            </span>
        </div>
        <h1>Python Cookbook 读书笔记（一）</h1>
    </div>

        <!-- Page Content -->
    <div class="site-content" role="main">
        <article class="format-standard libretto-long-form"><div class="entry-content">
                <p>
《<a href="http://shop.oreilly.com/product/0636920027072.do">Python Cookbook</a>》读书笔记.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">chapter 1: Data Structures and Algorithms</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">1.6 Mapping Keys to Multiple Values in a Dictionary, by list value and defaultdict</h3>
<div class="outline-text-3" id="text-1-1">
<p>
example: create a dictionary with default value, by defaultdict
</p>

<p>
dictionary's property:
</p>
<ol class="org-ol">
<li>you can add new key to a dictionary
</li>
<li>but when you access a key that not exists, there will be error
</li>
<li>defaultdict is used to fix such problem.
</li>
</ol>
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">collections</span> <span class="kn">import</span> <span class="n">defaultdict</span>
<span class="sb">`dict`</span> <span class="o">=</span> <span class="n">defaultdict</span><span class="p">(</span><span class="sb">`func list`</span><span class="p">)</span>
<span class="c1"># `dict`['aaa'].append(2)</span>
<span class="err">$</span><span class="mi">0</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">1.6 example</h3>
<div class="outline-text-3" id="text-1-2">
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">collections</span> <span class="kn">import</span> <span class="n">defaultdict</span>
<span class="n">frequency</span> <span class="o">=</span> <span class="n">defaultdict</span><span class="p">(</span><span class="nb">int</span><span class="p">)</span>
<span class="n">frequency</span><span class="p">[</span><span class="s1">'colorless'</span><span class="p">]</span> <span class="o">=</span> <span class="mi">4</span>
<span class="n">frequency</span><span class="p">[</span><span class="s1">'ideas'</span><span class="p">]</span> <span class="c1"># will be 0</span>

<span class="n">frequency</span> <span class="o">=</span> <span class="n">defaultdict</span><span class="p">(</span><span class="nb">list</span><span class="p">)</span>
<span class="c1"># first, frequency['colorless'] will return a empty list, then append one element to this list.</span>
<span class="n">frequency</span><span class="p">[</span><span class="s1">'colorless'</span><span class="p">]</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="mi">4</span><span class="p">)</span>
<span class="n">frequency</span><span class="p">[</span><span class="s1">'ideas'</span><span class="p">]</span> <span class="c1"># will be []</span>

<span class="c1"># Or you can pass a function take no arguments </span>

<span class="c1"># the idiom:</span>
<span class="n">my_dictionary</span> <span class="o">=</span> <span class="n">defaultdict</span><span class="p">(</span><span class="n">function</span> <span class="n">to</span> <span class="n">create</span> <span class="n">default</span> <span class="n">value</span><span class="p">)</span>
<span class="k">for</span> <span class="n">item</span> <span class="ow">in</span> <span class="n">sequence</span><span class="p">:</span>
<span class="n">my_dictionary</span><span class="p">[</span><span class="n">item_key</span><span class="p">]</span> <span class="ow">is</span> <span class="n">updated</span> <span class="k">with</span> <span class="n">information</span> <span class="n">about</span> <span class="n">item</span>
</pre></div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">1.7 Keeping Dictionaries in Order, OrderedDict</h3>
<div class="outline-text-3" id="text-1-3">
<div class="highlight"><pre><span></span><span class="n">form</span> <span class="n">collections</span> <span class="kn">import</span> <span class="nn">OrderedDict</span>
<span class="n">d</span> <span class="o">=</span> <span class="n">OrderedDict</span><span class="p">()</span>
<span class="c1"># the insertion order will be reserved.</span>
</pre></div>

<p>
An typical application is when for serilization.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">1.8. Calculating with Dictionaries</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">get max key/value in a dictionary, based on the value, by inverting the dict</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="highlight"><pre><span></span><span class="nb">max</span><span class="p">(</span><span class="nb">zip</span><span class="p">(</span><span class="sb">`dict`</span><span class="o">.</span><span class="n">values</span><span class="p">(),</span> <span class="sb">`dict`</span><span class="o">.</span><span class="n">keys</span><span class="p">()))</span>
<span class="c1"># another solution</span>
<span class="c1"># max(`dict`, key=lambda k:`dict`[k])</span>
</pre></div>
<p>
first convert the dict to list of (value, key) pairs, then max function will first compare value, then compare key.
</p>
</div>
</div>
<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">result of the max value for many  things</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
for tuple and list, it just the element.
but for a dict, it returns only the key. Why? Because it accept a iterable as first parameter, and for a dictionary, the iterable value is the key.
</p>
</div>
</div>
<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3">understanding of multi value bind</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
---&gt;  (b11, b12) = 1
TypeError: 'int' object is not iterable
</p>

<p>
The right hand side should be an iterable, every element in the iterable will be asigned to the left hand side variable, with each variable comsume one element exzactly. If the number of elements and variables not match, then there will be an error.
</p>

<p>
To consume more than one values, use the '*varname' expresstion, then the variable 'varname' will be a list of many elements.
</p>

<p>
Back to the error prints in the example, the 'int' object refers to the right side '1'.
</p>

<p>
PS:
I find python much simpler and funny than java.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">1.9. Finding Commonalities in Two Dictionaries</h3>
<div class="outline-text-3" id="text-1-5">
<p>
a dictionary's d.keys() and d.items() support set operations
So to find the common part keys/items in two dictionaries, just use the set operation '|' or 'union' function.
</p>
</div>
<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">get all keys as a iterable in a dictionary, by keys()</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="highlight"><pre><span></span><span class="sb">`dict`</span><span class="o">.</span><span class="n">keys</span><span class="p">()</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2">get all values as a iterable in a dictionary, by values()</h4>
<div class="outline-text-4" id="text-1-5-2">
<div class="highlight"><pre><span></span><span class="sb">`dict`</span><span class="o">.</span><span class="n">values</span><span class="p">()</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-5-3" class="outline-4">
<h4 id="sec-1-5-3">get all key, value pairs as a iterable in a dictionary, by items()</h4>
<div class="outline-text-4" id="text-1-5-3">
<div class="highlight"><pre><span></span><span class="sb">`dict`</span><span class="o">.</span><span class="n">items</span><span class="p">()</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-5-4" class="outline-4">
<h4 id="sec-1-5-4">set operations</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
'|': union
'&amp;': intersection
'-': difference
's1 &lt; s2': check if s1 is a subset of s2
</p>

<p>
Example:
In <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>: e.keys(), d.keys()
Out<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup>: (dict_keys([1, 4, 'a', 9]), dict_keys([1, 3, 5]))
</p>

<p>
In <sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>: e.keys() &amp; d.keys()
Out<sup><a id="fnr.2.100" name="fnr.2.100" class="footref" href="#fn.2">2</a></sup>: {1}
</p>

<p>
In <sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>: e.keys() | d.keys()
Out<sup><a id="fnr.3.100" name="fnr.3.100" class="footref" href="#fn.3">3</a></sup>: {1, 3, 4, 5, 'a', 9}
</p>

<p>
In <sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup>: e.keys() - d.keys()
Out<sup><a id="fnr.4.100" name="fnr.4.100" class="footref" href="#fn.4">4</a></sup>: {9, 4, 'a'}
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">1.10. Removing Duplicates from a Sequence while Maintaining Order</h3>
<div class="outline-text-3" id="text-1-6">
</div>
