posts/python-cookbook-readnote-1/index.org
*** problem: what is hashable(and the link to python glossary)
    From the python glossary: 
    https://docs.python.org/3/glossary.html
    
    An object is hashable if it has a hash value which never changes during its lifetime (it needs a __hash__() method), and can be compared to other objects (it needs an __eq__() or __cmp__() method). Hashable objects which compare equal must have the same hash value.
    
    Hashability makes an object usable as a dictionary key and a set member, because these data structures use the hash value internally.
    
    All of Python’s immutable built-in objects are hashable, while no mutable containers (such as lists or dictionaries) are. Objects which are instances of user-defined classes are hashable by default; they all compare unequal, and their hash value is their id().
*** how yield/generator iterator is implemented
    From the glossary, it works by suspends the function and  return the value, and save the current status. Then if it was called  next time, it will start execute from the place last time it was suspended. Great!! I understanded this.
    
    generator
    A function which returns a generator iterator. It looks like a normal function except that it contains yield expressions for producing a series of values usable in a for-loop or that can be retrieved one at a time with the next() function.
    Usually refers to a generator function, but may refer to a generator iterator in some contexts. In cases where the intended meaning isn’t clear, using the full terms avoids ambiguity.
    
    generator iterator
    An object created by a generator function.
    Each yield temporarily suspends processing, remembering the location execution state (including local variables and pending try-statements). When the generator iterator resumes, it picks-up where it left-off (in contrast to functions which start fresh on every invocation).
    
*** file object is also an iterable, the element is a line
    #+begin_src python
    with open(somefile,'r') as f:
        for line in f:
            print(line)
    #+end_src
    
*** a function that delete all duplicates in a list, with order preserved
    #+begin_src python
    def dedupe(items, key=None):
        seen = set()
        for item in items:
            val = item if key is None else key(item)
            if val not in seen:
                yield item
                seen.add(val)
    #+end_src
    If the element is hashable, then key function is not needed. Else, provide a fucntion to convert the  element to a hashable element.
    
    examples:
    >>> a = [ {'x':1, 'y':2}, {'x':1, 'y':3}, {'x':1, 'y':2}, {'x':2, 'y':4}]
    >>> list(dedupe(a, key=lambda d: (d['x'],d['y'])))
    [{'x': 1, 'y': 2}, {'x': 1, 'y': 3}, {'x': 2, 'y': 4}]
    >>> list(dedupe(a, key=lambda d: d['x']))
    [{'x': 1, 'y': 2}, {'x': 2, 'y': 4}]
    >>>
    
*** delete all duplicates in a list, don't preserve order, by set
    #+begin_src python
    set(`list`)
    #+end_src
    Then all duplicate elements in list will be removed.
    
*** the a?b:c expression in python, if else in one line
    #+begin_src python
    val = b if a else c
    #+end_src
    looks good
    
** 1.11. Naming a Slice
*** the slice object
    create a  slice
    #+begin_src python
   a=[1,2,3,4]
   s = slice(1,2)
   print(a[s])
   print(a[1:2])
    #+end_src
    '1:2' is just a shortcut to 'slice(1,2)'
    
    slice attributes
    #+begin_src python
    s = slice(1,2,2)
    print(s.start, s.stop, s.step)
    #+end_src
    
    #+RESULTS:
    
    
** 1.12. Determining the Most Frequently Occurring Items in a Sequence
   A method by me
   #+begin_src python
   a = [1, 2, 1, 3, 2,3,3]
   from collections import defaultdict
   d = defaultdict(int)
   # b = [d[k]+=1 for k in a]  # syntax error here
   for k in a:
       d[k]+=1

   r = max(zip(d.values(), d.keys()))
   print(r[1])
   #+end_src
   
   
