posts/python-cookbook-readnote-1/index.org
*** the collections.Counter class: change a list to a list of tuple of (element, count)
    #+begin_src python :results output
    a = [1, 2, 1, 3, 2,3,3]
    from collections import Counter
    b = Counter(a)
    c = b.most_common(1)
    print(c[0][0])

    # get the count
    print(b[3]) # 3 is the element in a


    # update with more words
    b.update([4, 2, 5])

    # and a Counter object support the math operations: '+' and '-'

    #+end_src
    
    #+RESULTS:
    : 3
    : 3
    
    When you need to count data, use Counter class. This is a so little class, in practice, I will always write it from scratch before.
    
** 1.13. Sorting a List of Dictionaries by a Common Key
   
*** the operator.itemgetter function
    it will return a callable that can be passed to 'sorted':s key  parameter, for list  or dictionary
    #+begin_src python
    # return value of
    import operator
    operator.itemgetter("name")
    # is the same as this one
    lambda r:r["name"]
    # but the former  is a little faster
    #+end_src
    
    仍然是非常小的功能，为什么搞得这么精细呢？
    
** 1.14. Sorting Objects Without Native Comparison Support
*** the operator.attrgetter function
    it will return a callable that can be passed to 'sorted':s key  parameter, for user defined class
    #+begin_src python
    class User():
        def __init__(self, name):
            self.name = name

        def __repr__(self):
            return 'User({})'.format(self.name)

    # return value of
    operator.attrgetter("name")
    # is the same as this one
    lambda o:o.name
    # but the former  is a little faster
    #+end_src
** 1.15. Grouping Records(a sequence of dictionaries) Together Based on a Field
*** the itertools.groupby function: group sequencially the list as tuple (key, items)
    #+begin_src python
    import itertools
    rows =  [{1:2}, {1: 4},  {1: 3}]
    # a should be a generator
    rows.sort(key=itemgetter(1))
    a = itertools.groupby(rows, key=itemgetter(1))
    #+end_src
    
    another way is just use a default list dictionary to group, then no sort is needed.
    
    
    
    
    
    
** 1.16. Filtering Sequence Elements
   To fitering, just use list comprehension with an if condition
*** itertools.compress function, a filtering tool
    it takse two parameters:
    1. an iterable which to be compressed
    2. a Boolean sequence, with the same length of first parameter
       if the element in this sequence  is True, then the element at the same position in the first iterable will be put to the output
       
       An example:
    #+begin_src python
    addresses = [
        '5412 N CLARK',
        '5148 N CLARK',
        '5800 E 58TH',
        '2122 N CLARK'
        '5645 N RAVENSWOOD',
        '1060 W ADDISON',
        '4801 N BROADWAY',
        '1039 W GRANVILLE',
    ]
    counts = [ 0, 3, 10, 4, 1, 7, 6, 1]

    import itertools
    b = [e > 5 for e in counts]
    a = itertools.compress(addresses, b)
    # Now a will be all items where count larger than 5
    print(a)
    #+end_src
    
    
    
** 1.17. Extracting a Subset of a Dictionary
*** dictionary comprehension, just like list comprehension, but use '{' instead of '['
    #+begin_src python
    prices = {
        'ACME': 45.23,
        'AAPL': 612.78,
        'IBM': 205.55,
        'HPQ': 37.20,
        'FB': 10.75
    }
    # Make a dictionary of all prices over 200
    p1 = { key:value for key, value in prices.items() if value > 200 }
    # Make a dictionary of tech stocks
    tech_names = { 'AAPL', 'IBM', 'HPQ', 'MSFT' }
    p2 = { key:value for key,value in prices.items() if key in tech_names }
    #+end_src
