posts/python-cookbook-readnote-1/index.html


<div id="outline-container-sec-1-8-1" class="outline-4">
<h4 id="sec-1-8-1">the collections.Counter class: change a list to a list of tuple of (element, count)</h4>
<div class="outline-text-4" id="text-1-8-1">
<div class="highlight"><pre><span></span><span class="n">a</span> <span class="o">=</span> <span class="p">[</span><span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">3</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span><span class="mi">3</span><span class="p">,</span><span class="mi">3</span><span class="p">]</span>
<span class="kn">from</span> <span class="nn">collections</span> <span class="kn">import</span> <span class="n">Counter</span>
<span class="n">b</span> <span class="o">=</span> <span class="n">Counter</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
<span class="n">c</span> <span class="o">=</span> <span class="n">b</span><span class="o">.</span><span class="n">most_common</span><span class="p">(</span><span class="mi">1</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">c</span><span class="p">[</span><span class="mi">0</span><span class="p">][</span><span class="mi">0</span><span class="p">])</span>

<span class="c1"># get the count</span>
<span class="k">print</span><span class="p">(</span><span class="n">b</span><span class="p">[</span><span class="mi">3</span><span class="p">])</span> <span class="c1"># 3 is the element in a</span>


<span class="c1"># update with more words</span>
<span class="n">b</span><span class="o">.</span><span class="n">update</span><span class="p">([</span><span class="mi">4</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">5</span><span class="p">])</span>

<span class="c1"># and a Counter object support the math operations: '+' and '-'</span>
</pre></div>

<p>
When you need to count data, use Counter class. This is a so little class, in practice, I will always write it from scratch before.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">1.13. Sorting a List of Dictionaries by a Common Key</h3>
<div class="outline-text-3" id="text-1-9">
</div>
<div id="outline-container-sec-1-9-1" class="outline-4">
<h4 id="sec-1-9-1">the operator.itemgetter function</h4>
<div class="outline-text-4" id="text-1-9-1">
<p>
it will return a callable that can be passed to 'sorted':s key  parameter, for list  or dictionary
</p>
<div class="highlight"><pre><span></span><span class="c1"># return value of</span>
<span class="kn">import</span> <span class="nn">operator</span>
<span class="n">operator</span><span class="o">.</span><span class="n">itemgetter</span><span class="p">(</span><span class="s2">"name"</span><span class="p">)</span>
<span class="c1"># is the same as this one</span>
<span class="k">lambda</span> <span class="n">r</span><span class="p">:</span><span class="n">r</span><span class="p">[</span><span class="s2">"name"</span><span class="p">]</span>
<span class="c1"># but the former  is a little faster</span>
</pre></div>

<p>
仍然是非常小的功能，为什么搞得这么精细呢？
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10">1.14. Sorting Objects Without Native Comparison Support</h3>
<div class="outline-text-3" id="text-1-10">
</div>
<div id="outline-container-sec-1-10-1" class="outline-4">
<h4 id="sec-1-10-1">the operator.attrgetter function</h4>
<div class="outline-text-4" id="text-1-10-1">
<p>
it will return a callable that can be passed to 'sorted':s key  parameter, for user defined class
</p>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">User</span><span class="p">():</span>
    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">name</span><span class="p">):</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">name</span> <span class="o">=</span> <span class="n">name</span>

    <span class="k">def</span> <span class="fm">__repr__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="k">return</span> <span class="s1">'User({})'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">name</span><span class="p">)</span>

<span class="c1"># return value of</span>
<span class="n">operator</span><span class="o">.</span><span class="n">attrgetter</span><span class="p">(</span><span class="s2">"name"</span><span class="p">)</span>
<span class="c1"># is the same as this one</span>
<span class="k">lambda</span> <span class="n">o</span><span class="p">:</span><span class="n">o</span><span class="o">.</span><span class="n">name</span>
<span class="c1"># but the former  is a little faster</span>
</pre></div>
</div>
</div>
</div>
<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11">1.15. Grouping Records(a sequence of dictionaries) Together Based on a Field</h3>
<div class="outline-text-3" id="text-1-11">
</div>
<div id="outline-container-sec-1-11-1" class="outline-4">
<h4 id="sec-1-11-1">the itertools.groupby function: group sequencially the list as tuple (key, items)</h4>
<div class="outline-text-4" id="text-1-11-1">
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">itertools</span>
<span class="n">rows</span> <span class="o">=</span>  <span class="p">[{</span><span class="mi">1</span><span class="p">:</span><span class="mi">2</span><span class="p">},</span> <span class="p">{</span><span class="mi">1</span><span class="p">:</span> <span class="mi">4</span><span class="p">},</span>  <span class="p">{</span><span class="mi">1</span><span class="p">:</span> <span class="mi">3</span><span class="p">}]</span>
<span class="c1"># a should be a generator</span>
<span class="n">rows</span><span class="o">.</span><span class="n">sort</span><span class="p">(</span><span class="n">key</span><span class="o">=</span><span class="n">itemgetter</span><span class="p">(</span><span class="mi">1</span><span class="p">))</span>
<span class="n">a</span> <span class="o">=</span> <span class="n">itertools</span><span class="o">.</span><span class="n">groupby</span><span class="p">(</span><span class="n">rows</span><span class="p">,</span> <span class="n">key</span><span class="o">=</span><span class="n">itemgetter</span><span class="p">(</span><span class="mi">1</span><span class="p">))</span>
</pre></div>

<p>
another way is just use a default list dictionary to group, then no sort is needed.
</p>
</div>
</div>
</div>






<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12">1.16. Filtering Sequence Elements</h3>
<div class="outline-text-3" id="text-1-12">
<p>
To fitering, just use list comprehension with an if condition
</p>
</div>
<div id="outline-container-sec-1-12-1" class="outline-4">
<h4 id="sec-1-12-1">itertools.compress function, a filtering tool</h4>
<div class="outline-text-4" id="text-1-12-1">
<p>
it takse two parameters:
</p>
<ol class="org-ol">
<li>an iterable which to be compressed
</li>
<li>a Boolean sequence, with the same length of first parameter
if the element in this sequence  is True, then the element at the same position in the first iterable will be put to the output

<p>
An example:
</p>
</li>
</ol>
<div class="highlight"><pre><span></span><span class="n">addresses</span> <span class="o">=</span> <span class="p">[</span>
    <span class="s1">'5412 N CLARK'</span><span class="p">,</span>
    <span class="s1">'5148 N CLARK'</span><span class="p">,</span>
    <span class="s1">'5800 E 58TH'</span><span class="p">,</span>
    <span class="s1">'2122 N CLARK'</span>
    <span class="s1">'5645 N RAVENSWOOD'</span><span class="p">,</span>
    <span class="s1">'1060 W ADDISON'</span><span class="p">,</span>
    <span class="s1">'4801 N BROADWAY'</span><span class="p">,</span>
    <span class="s1">'1039 W GRANVILLE'</span><span class="p">,</span>
<span class="p">]</span>
<span class="n">counts</span> <span class="o">=</span> <span class="p">[</span> <span class="mi">0</span><span class="p">,</span> <span class="mi">3</span><span class="p">,</span> <span class="mi">10</span><span class="p">,</span> <span class="mi">4</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">7</span><span class="p">,</span> <span class="mi">6</span><span class="p">,</span> <span class="mi">1</span><span class="p">]</span>

<span class="kn">import</span> <span class="nn">itertools</span>
<span class="n">b</span> <span class="o">=</span> <span class="p">[</span><span class="n">e</span> <span class="o">&gt;</span> <span class="mi">5</span> <span class="k">for</span> <span class="n">e</span> <span class="ow">in</span> <span class="n">counts</span><span class="p">]</span>
<span class="n">a</span> <span class="o">=</span> <span class="n">itertools</span><span class="o">.</span><span class="n">compress</span><span class="p">(</span><span class="n">addresses</span><span class="p">,</span> <span class="n">b</span><span class="p">)</span>
<span class="c1"># Now a will be all items where count larger than 5</span>
<span class="k">print</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
</pre></div>
</div>
</div>
</div>



<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13">1.17. Extracting a Subset of a Dictionary</h3>
<div class="outline-text-3" id="text-1-13">
</div>
<div id="outline-container-sec-1-13-1" class="outline-4">
<h4 id="sec-1-13-1">dictionary comprehension, just like list comprehension, but use '{' instead of '['</h4>
<div class="outline-text-4" id="text-1-13-1">
<div class="highlight"><pre><span></span><span class="n">prices</span> <span class="o">=</span> <span class="p">{</span>
    <span class="s1">'ACME'</span><span class="p">:</span> <span class="mf">45.23</span><span class="p">,</span>
    <span class="s1">'AAPL'</span><span class="p">:</span> <span class="mf">612.78</span><span class="p">,</span>
    <span class="s1">'IBM'</span><span class="p">:</span> <span class="mf">205.55</span><span class="p">,</span>
    <span class="s1">'HPQ'</span><span class="p">:</span> <span class="mf">37.20</span><span class="p">,</span>
    <span class="s1">'FB'</span><span class="p">:</span> <span class="mf">10.75</span>
<span class="p">}</span>
<span class="c1"># Make a dictionary of all prices over 200</span>
<span class="n">p1</span> <span class="o">=</span> <span class="p">{</span> <span class="n">key</span><span class="p">:</span><span class="n">value</span> <span class="k">for</span> <span class="n">key</span><span class="p">,</span> <span class="n">value</span> <span class="ow">in</span> <span class="n">prices</span><span class="o">.</span><span class="n">items</span><span class="p">()</span> <span class="k">if</span> <span class="n">value</span> <span class="o">&gt;</span> <span class="mi">200</span> <span class="p">}</span>
<span class="c1"># Make a dictionary of tech stocks</span>
<span class="n">tech_names</span> <span class="o">=</span> <span class="p">{</span> <span class="s1">'AAPL'</span><span class="p">,</span> <span class="s1">'IBM'</span><span class="p">,</span> <span class="s1">'HPQ'</span><span class="p">,</span> <span class="s1">'MSFT'</span> <span class="p">}</span>
<span class="n">p2</span> <span class="o">=</span> <span class="p">{</span> <span class="n">key</span><span class="p">:</span><span class="n">value</span> <span class="k">for</span> <span class="n">key</span><span class="p">,</span><span class="n">value</span> <span class="ow">in</span> <span class="n">prices</span><span class="o">.</span><span class="n">items</span><span class="p">()</span> <span class="k">if</span> <span class="n">key</span> <span class="ow">in</span> <span class="n">tech_names</span> <span class="p">}</span>
</pre></div>
</div>
</div>
</div>
