posts/python-cookbook-readnote-1/index.org
** 1.18. Mapping Names to Sequence Elements
*** the collections.nametuple function, map an index to a name, and access to an element with that name
    example:
    #+begin_src python
    from collections import namedtuple
    People =  namedtuple('People', ['name', 'age'])
    p = People(name='Jim', age=12)
    print(p, p.name, p.age)
    #+end_src
    
    #+RESULTS:
    
    A good application:
    for database selection.
    
    The ._replace method:
    Because a tuple is immutable, so to change an element, you can use _replace to  replace a field and a new one will be returned.
    A tipical usage is first  create a prototype element with all field value be the default one, then update some fields with the _replace function.
    Why there is a '_' in the function name?
    #+begin_src python
    from collections import namedtuple
    Stock = namedtuple('Stock', ['name', 'shares', 'price', 'date', 'time'])
    # Create a prototype instance
    stock_prototype = Stock('', 0, 0.0, None, None)
    # Function to convert a dictionary to a Stock
    def dict_to_stock(s):
        return stock_prototype._replace(**s)

    a = {'name': 'ACME', 'shares': 100, 'price': 123.45}
    dict_to_stock(a)
    # Stock(name='ACME', shares=100, price=123.45, date=None, time=None)
    #+end_src
    
** 1.19. Transforming and Reducing Data at the Same Time
   use generator-expression argument
   
   The reducing function means: given a list, return a value.
** the any function, check if any of an element is True in a iterable
*** check if  any .py files exist in a directory
    #+begin_src python
   # Determine if any .py files exist in a directory
   import os
   files = os.listdir('dirname')
   if any(name.endswith('.py') for name in files):
       print('There be python!')
   else:
       print('Sorry, no python.')
    #+end_src
*** get all files in a directory as a list
    #+begin_src python
   import os
   files = os.listdir('dirname')
    #+end_src
*** change a tuple/list/iterable to a csv line
    This is much better than the string format method
    #+begin_src python
    # Output a tuple as CSV
    s = ('ACME', 50, 123.45)
    print(','.join(str(x) for x in s))# Output a tuple as CSV
    #+end_src
    
** 1.20. Combining Multiple Mappings into a Single Mapping
*** the collections.ChainMap
    combining many maps/dictionaries, then when get an element, it will try to get from the first map, then the second, ...
    
    And for operations that mutate the mapping always affect the first map/dictionary.
    
    typical application:
    scoped variable in a programming language.
    
    Difference from the dict.update function:
    ChainMap use a link to the original dictionary, while dict.update create a new one.
**** check if an element exists in many dictionaries/maps, sequencially
     #+begin_src python :results output
     a = {'x': 1, 'z': 3 }
     b = {'y': 2, 'z': 4 }
     from collections import ChainMap
     c = ChainMap(a,b)
     print(c['x']) # Outputs 1 (from a)
     print(c['y']) # Outputs 2 (from b)
     print(c['z']) # Outputs 3 (from a)
     #+end_src
     
     #+RESULTS:
     : 1
     : 2
     : 3