posts/python-cookbook-readnote-1/index.html
<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14">1.18. Mapping Names to Sequence Elements</h3>
<div class="outline-text-3" id="text-1-14">
</div>
<div id="outline-container-sec-1-14-1" class="outline-4">
<h4 id="sec-1-14-1">the collections.nametuple function, map an index to a name, and access to an element with that name</h4>
<div class="outline-text-4" id="text-1-14-1">
<p>
example:
</p>
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">collections</span> <span class="kn">import</span> <span class="n">namedtuple</span>
<span class="n">People</span> <span class="o">=</span>  <span class="n">namedtuple</span><span class="p">(</span><span class="s1">'People'</span><span class="p">,</span> <span class="p">[</span><span class="s1">'name'</span><span class="p">,</span> <span class="s1">'age'</span><span class="p">])</span>
<span class="n">p</span> <span class="o">=</span> <span class="n">People</span><span class="p">(</span><span class="n">name</span><span class="o">=</span><span class="s1">'Jim'</span><span class="p">,</span> <span class="n">age</span><span class="o">=</span><span class="mi">12</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">p</span><span class="p">,</span> <span class="n">p</span><span class="o">.</span><span class="n">name</span><span class="p">,</span> <span class="n">p</span><span class="o">.</span><span class="n">age</span><span class="p">)</span>
</pre></div>

<p>
A good application:
for database selection.
</p>

<p>
The ._replace method:
Because a tuple is immutable, so to change an element, you can use _replace to  replace a field and a new one will be returned.
A tipical usage is first  create a prototype element with all field value be the default one, then update some fields with the _replace function.
Why there is a '_' in the function name?
</p>
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">collections</span> <span class="kn">import</span> <span class="n">namedtuple</span>
<span class="n">Stock</span> <span class="o">=</span> <span class="n">namedtuple</span><span class="p">(</span><span class="s1">'Stock'</span><span class="p">,</span> <span class="p">[</span><span class="s1">'name'</span><span class="p">,</span> <span class="s1">'shares'</span><span class="p">,</span> <span class="s1">'price'</span><span class="p">,</span> <span class="s1">'date'</span><span class="p">,</span> <span class="s1">'time'</span><span class="p">])</span>
<span class="c1"># Create a prototype instance</span>
<span class="n">stock_prototype</span> <span class="o">=</span> <span class="n">Stock</span><span class="p">(</span><span class="s1">''</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="mf">0.0</span><span class="p">,</span> <span class="bp">None</span><span class="p">,</span> <span class="bp">None</span><span class="p">)</span>
<span class="c1"># Function to convert a dictionary to a Stock</span>
<span class="k">def</span> <span class="nf">dict_to_stock</span><span class="p">(</span><span class="n">s</span><span class="p">):</span>
    <span class="k">return</span> <span class="n">stock_prototype</span><span class="o">.</span><span class="n">_replace</span><span class="p">(</span><span class="o">**</span><span class="n">s</span><span class="p">)</span>

<span class="n">a</span> <span class="o">=</span> <span class="p">{</span><span class="s1">'name'</span><span class="p">:</span> <span class="s1">'ACME'</span><span class="p">,</span> <span class="s1">'shares'</span><span class="p">:</span> <span class="mi">100</span><span class="p">,</span> <span class="s1">'price'</span><span class="p">:</span> <span class="mf">123.45</span><span class="p">}</span>
<span class="n">dict_to_stock</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
<span class="c1"># Stock(name='ACME', shares=100, price=123.45, date=None, time=None)</span>
</pre></div>
</div>
</div>
</div>

<div id="outline-container-sec-1-15" class="outline-3">
<h3 id="sec-1-15">1.19. Transforming and Reducing Data at the Same Time</h3>
<div class="outline-text-3" id="text-1-15">
<p>
use generator-expression argument
</p>

<p>
The reducing function means: given a list, return a value.
</p>
</div>
</div>
<div id="outline-container-sec-1-16" class="outline-3">
<h3 id="sec-1-16">the any function, check if any of an element is True in a iterable</h3>
<div class="outline-text-3" id="text-1-16">
</div>
<div id="outline-container-sec-1-16-1" class="outline-4">
<h4 id="sec-1-16-1">check if  any .py files exist in a directory</h4>
<div class="outline-text-4" id="text-1-16-1">
<div class="highlight"><pre><span></span><span class="c1"># Determine if any .py files exist in a directory</span>
<span class="kn">import</span> <span class="nn">os</span>
<span class="n">files</span> <span class="o">=</span> <span class="n">os</span><span class="o">.</span><span class="n">listdir</span><span class="p">(</span><span class="s1">'dirname'</span><span class="p">)</span>
<span class="k">if</span> <span class="nb">any</span><span class="p">(</span><span class="n">name</span><span class="o">.</span><span class="n">endswith</span><span class="p">(</span><span class="s1">'.py'</span><span class="p">)</span> <span class="k">for</span> <span class="n">name</span> <span class="ow">in</span> <span class="n">files</span><span class="p">):</span>
    <span class="k">print</span><span class="p">(</span><span class="s1">'There be python!'</span><span class="p">)</span>
<span class="k">else</span><span class="p">:</span>
    <span class="k">print</span><span class="p">(</span><span class="s1">'Sorry, no python.'</span><span class="p">)</span>
</pre></div>
</div>
</div>
<div id="outline-container-sec-1-16-2" class="outline-4">
<h4 id="sec-1-16-2">get all files in a directory as a list</h4>
<div class="outline-text-4" id="text-1-16-2">
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">os</span>
<span class="n">files</span> <span class="o">=</span> <span class="n">os</span><span class="o">.</span><span class="n">listdir</span><span class="p">(</span><span class="s1">'dirname'</span><span class="p">)</span>
</pre></div>
</div>
</div>
<div id="outline-container-sec-1-16-3" class="outline-4">
<h4 id="sec-1-16-3">change a tuple/list/iterable to a csv line</h4>
<div class="outline-text-4" id="text-1-16-3">
<p>
This is much better than the string format method
</p>
<div class="highlight"><pre><span></span><span class="c1"># Output a tuple as CSV</span>
<span class="n">s</span> <span class="o">=</span> <span class="p">(</span><span class="s1">'ACME'</span><span class="p">,</span> <span class="mi">50</span><span class="p">,</span> <span class="mf">123.45</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="s1">','</span><span class="o">.</span><span class="n">join</span><span class="p">(</span><span class="nb">str</span><span class="p">(</span><span class="n">x</span><span class="p">)</span> <span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="n">s</span><span class="p">))</span><span class="c1"># Output a tuple as CSV</span>
</pre></div>
</div>
</div>
</div>

<div id="outline-container-sec-1-17" class="outline-3">
<h3 id="sec-1-17">1.20. Combining Multiple Mappings into a Single Mapping</h3>
<div class="outline-text-3" id="text-1-17">
</div>
<div id="outline-container-sec-1-17-1" class="outline-4">
<h4 id="sec-1-17-1">the collections.ChainMap</h4>
<div class="outline-text-4" id="text-1-17-1">
<p>
combining many maps/dictionaries, then when get an element, it will try to get from the first map, then the second, ...
</p>

<p>
And for operations that mutate the mapping always affect the first map/dictionary.
</p>

<p>
typical application:
scoped variable in a programming language.
</p>

<p>
Difference from the dict.update function:
ChainMap use a link to the original dictionary, while dict.update create a new one.
</p>
</div>
<ul class="org-ul"><li>
<a id="sec-1-17-1-1" name="sec-1-17-1-1"></a>check if an element exists in many dictionaries/maps, sequencially<br><div class="outline-text-5" id="text-1-17-1-1">
<div class="highlight"><pre><span></span><span class="n">a</span> <span class="o">=</span> <span class="p">{</span><span class="s1">'x'</span><span class="p">:</span> <span class="mi">1</span><span class="p">,</span> <span class="s1">'z'</span><span class="p">:</span> <span class="mi">3</span> <span class="p">}</span>
<span class="n">b</span> <span class="o">=</span> <span class="p">{</span><span class="s1">'y'</span><span class="p">:</span> <span class="mi">2</span><span class="p">,</span> <span class="s1">'z'</span><span class="p">:</span> <span class="mi">4</span> <span class="p">}</span>
<span class="kn">from</span> <span class="nn">collections</span> <span class="kn">import</span> <span class="n">ChainMap</span>
<span class="n">c</span> <span class="o">=</span> <span class="n">ChainMap</span><span class="p">(</span><span class="n">a</span><span class="p">,</span><span class="n">b</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">c</span><span class="p">[</span><span class="s1">'x'</span><span class="p">])</span> <span class="c1"># Outputs 1 (from a)</span>
<span class="k">print</span><span class="p">(</span><span class="n">c</span><span class="p">[</span><span class="s1">'y'</span><span class="p">])</span> <span class="c1"># Outputs 2 (from b)</span>
<span class="k">print</span><span class="p">(</span><span class="n">c</span><span class="p">[</span><span class="s1">'z'</span><span class="p">])</span> <span class="c1"># Outputs 3 (from a)</span>
</pre></div>
</div>
</li></ul>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef">
<sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup><p>DEFINITION NOT FOUND.</p>
</div>

<div class="footdef">
<sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup><p>DEFINITION NOT FOUND.</p>
</div>

<div class="footdef">
<sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup><p>DEFINITION NOT FOUND.</p>
</div>

<div class="footdef">
<sup><a id="fn.4" name="fn.4" class="footnum" href="#fnr.4">4</a></sup><p>DEFINITION NOT FOUND.</p>
</div>


</div>
</div>
            </div>
        </article>
</div>

        <!-- Tag Section -->
    <div class="site-content navigation-post">
        <div class="tag-head">Tags</div>
        <div class="tag-list">
                <a href="../../categories/python/">python</a>
        </div>
    </div>

        <!-- Post Navigation links -->
<nav class="site-content navigation-post" role="navigation"><div class="previous">
            <a href="../hmm-word-segmentation/" rel="prev">
                <span class="meta-nav">Older Post</span>基于隐马尔科夫模型的中文分词方法
            </a>
        </div>
        <div class="next">
            <a href="../python-cookbook-readnote-2/" rel="next">
                <span class="meta-nav">Newer Post</span>Python Cookbook 读书笔记（二）
            </a>
        </div>
</nav><!-- Page Footer --><section class="footer-sidebar clear" role="complementary"><div class="widget-block">
            <aside class="widget"><h2 class="widget-title">Astropeak</h2>
                <div class="widget-text">Astropeak's blogs.</div>
            </aside>
</div>
    </section><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
            <p>Contents © 2018         <a href="mailto:astropeak@gmail.com">Astropeak</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
        </div>
        <div class="social">
            <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>
